incomressible/steady/laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19800;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19900;
    }
    bottom_axis
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          100;
        startFace       20000;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       20100;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
